# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. Каждый день спортсмен увеличивал
# результат на 10 % относительно предыдущего. Требуется определить номер дня, на который общий результат спортсмена составить не менее
# b километров. Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

a = int(input('Введите километры в первый день: '))
b = int(input('Введите общее количество километров: '))

d = 1
while a < b:
	a = a * 1.1
	d+=1
print('на {} день спортсмен достиг результата — не менее {} км'.format(d,b))
